burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_adc.h
/*!
    \file    gd32e51x_adc.h
    \brief   definitions for the ADC

    \version 2024-12-30, V1.2.0, firmware for GD32E51x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32E51X_ADC_H
#define GD32E51X_ADC_H

#include "gd32e51x.h"

/* ADC definitions */
#define ADC0                            ADC_BASE
#define ADC1                            (ADC_BASE + 0x00000400U)
#define ADC2                            (ADC_BASE + 0x00001800U)

/* registers definitions */
#define ADC_STAT(adcx)                  REG32((adcx) + 0x00000000U)      /*!< ADC status register */
#define ADC_CTL0(adcx)                  REG32((adcx) + 0x00000004U)      /*!< ADC control register 0 */
#define ADC_CTL1(adcx)                  REG32((adcx) + 0x00000008U)      /*!< ADC control register 1 */
#define ADC_SAMPT0(adcx)                REG32((adcx) + 0x0000000CU)      /*!< ADC sampling time register 0 */
#define ADC_SAMPT1(adcx)                REG32((adcx) + 0x00000010U)      /*!< ADC sampling time register 1 */
#define ADC_IOFF0(adcx)                 REG32((adcx) + 0x00000014U)      /*!< ADC inserted channel data offset register 0 */
#define ADC_IOFF1(adcx)                 REG32((adcx) + 0x00000018U)      /*!< ADC inserted channel data offset register 1 */
#define ADC_IOFF2(adcx)                 REG32((adcx) + 0x0000001CU)      /*!< ADC inserted channel data offset register 2 */
#define ADC_IOFF3(adcx)                 REG32((adcx) + 0x00000020U)      /*!< ADC inserted channel data offset register 3 */
#define ADC_WDHT0(adcx)                 REG32((adcx) + 0x00000024U)      /*!< ADC watchdog high threshold register 0 */
#define ADC_WDLT0(adcx)                 REG32((adcx) + 0x00000028U)      /*!< ADC watchdog low threshold register 0 */
#define ADC_RSQ0(adcx)                  REG32((adcx) + 0x0000002CU)      /*!< ADC regular sequence register 0 */
#define ADC_RSQ1(adcx)                  REG32((adcx) + 0x00000030U)      /*!< ADC regular sequence register 1 */
#define ADC_RSQ2(adcx)                  REG32((adcx) + 0x00000034U)      /*!< ADC regular sequence register 2 */
#define ADC_ISQ(adcx)                   REG32((adcx) + 0x00000038U)      /*!< ADC inserted sequence register */
#define ADC_IDATA0(adcx)                REG32((adcx) + 0x0000003CU)      /*!< ADC inserted data register 0 */
#define ADC_IDATA1(adcx)                REG32((adcx) + 0x00000040U)      /*!< ADC inserted data register 1 */
#define ADC_IDATA2(adcx)                REG32((adcx) + 0x00000044U)      /*!< ADC inserted data register 2 */
#define ADC_IDATA3(adcx)                REG32((adcx) + 0x00000048U)      /*!< ADC inserted data register 3 */
#define ADC_RDATA(adcx)                 REG32((adcx) + 0x0000004CU)      /*!< ADC regular data register */
#define ADC_OVSAMPCTL(adcx)             REG32((adcx) + 0x00000080U)      /*!< ADC oversampling control register */
#define ADC_WD1SR(adcx)                 REG32((adcx) + 0x000000A0U)      /*!< ADC watchdog 1 channel selection register */
#define ADC_WD2SR(adcx)                 REG32((adcx) + 0x000000A4U)      /*!< ADC watchdog 2 channel selection register */
#define ADC_WDT1(adcx)                  REG32((adcx) + 0x000000A8U)      /*!< ADC watchdog threshold register 1 */
#define ADC_WDT2(adcx)                  REG32((adcx) + 0x000000ACU)      /*!< ADC watchdog threshold register 2 */
#define ADC_DIFCTL(adcx)                REG32((adcx) + 0x000000B0U)      /*!< ADC differential mode control register */

/* bits definitions */
/* ADC_STAT */
#define ADC_STAT_WDE0                   BIT(0)                           /*!< analog watchdog 0 event flag */
#define ADC_STAT_EOC                    BIT(1)                           /*!< end of conversion */
#define ADC_STAT_EOIC                   BIT(2)                           /*!< inserted channel end of conversion */
#define ADC_STAT_STIC                   BIT(3)                           /*!< inserted channel start flag */
#define ADC_STAT_STRC                   BIT(4)                           /*!< regular channel start flag */
#define ADC_STAT_WDE1                   BIT(30)                          /*!< analog watchdog 1 event flag */
#define ADC_STAT_WDE2                   BIT(31)                          /*!< analog watchdog 2 event flag */

/* ADC_CTL0 */
#define ADC_CTL0_WD0CHSEL               BITS(0, 4)                       /*!< analog watchdog 0 channel select bits */
#define ADC_CTL0_EOCIE                  BIT(5)                           /*!< interrupt enable for EOC */
#define ADC_CTL0_WDE0IE                 BIT(6)                           /*!< analog watchdog 0 interrupt enable */
#define ADC_CTL0_EOICIE                 BIT(7)                           /*!< interrupt enable for inserted channels */
#define ADC_CTL0_SM                     BIT(8)                           /*!< scan mode */
#define ADC_CTL0_WD0SC                  BIT(9)                           /*!< when in scan mode, analog watchdog 0 is effective on a single channel */
#define ADC_CTL0_ICA                    BIT(10)                          /*!< automatic inserted group conversion */
#define ADC_CTL0_DISRC                  BIT(11)                          /*!< discontinuous mode on regular channels */
#define ADC_CTL0_DISIC                  BIT(12)                          /*!< discontinuous mode on inserted channels */
#define ADC_CTL0_DISNUM                 BITS(13, 15)                     /*!< discontinuous mode channel count */
#define ADC_CTL0_SYNCM                  BITS(16, 19)                     /*!< sync mode selection */
#define ADC_CTL0_IWD0EN                 BIT(22)                          /*!< analog watchdog 0 enable on inserted channels */
#define ADC_CTL0_RWD0EN                 BIT(23)                          /*!< analog watchdog 0 enable on regular channels */
#define ADC_CTL0_WDE1IE                 BIT(30)                          /*!< analog watchdog 1 interrupt enable */
#define ADC_CTL0_WDE2IE                 BIT(31)                          /*!< analog watchdog 2 interrupt enable */

/* ADC_CTL1 */
#define ADC_CTL1_ADCON                  BIT(0)                           /*!< ADC converter on */
#define ADC_CTL1_CTN                    BIT(1)                           /*!< continuous conversion */
#define ADC_CTL1_CLB                    BIT(2)                           /*!< ADC calibration */
#define ADC_CTL1_RSTCLB                 BIT(3)                           /*!< reset calibration */
#define ADC_CTL1_CLBNUM                 BITS(4, 6)                       /*!< ADC calibration times */
#define ADC_CTL1_DMA                    BIT(8)                           /*!< DMA request enable */
#define ADC_CTL1_DAL                    BIT(11)                          /*!< data alignment */
#define ADC_CTL1_ETSIC                  (BIT(30) | BITS(12, 14))         /*!< external trigger select for inserted channel */
#define ADC_CTL1_ETEIC                  BIT(15)                          /*!< external trigger enable for inserted channel */
#define ADC_CTL1_ETSRC                  (BIT(31) | BITS(17, 19))         /*!< external trigger select for regular channel */
#define ADC_CTL1_ETERC                  BIT(20)                          /*!< external trigger  enable for regular channel */
#define ADC_CTL1_SWICST                 BIT(21)                          /*!< start on inserted channel */
#define ADC_CTL1_SWRCST                 BIT(22)                          /*!< start on regular channel */
#define ADC_CTL1_TSVREN                 BIT(23)                          /*!< channel 16 and 17 enable of ADC0 */
#define ADC_CTL1_ETSIC4                 BIT(30)                          /*!< bit 4 of ETSIC */
#define ADC_CTL1_ETSRC4                 BIT(31)                          /*!< bit 4 of ETSRC */

/* ADC_SAMPTx x=0..1 */
#define ADC_SAMPTX_SPTN                 BITS(0, 2)                       /*!< channel n(n=0..17) sample time selection */

